app/controllers/homes_controller.rb

  def index
  	@users = User.all
  	@feeds = current_user.feed.includes(:user) if current_user.present?
---
SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 1], ["id", 2]]