app/controllers/tweets_controller.rb

INSERT INTO "tweets" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Test 3's Tweet"], ["user_id", 5], ["created_at", "2020-02-06 14:03:58.997175"], ["updated_at", "2020-02-06 14:03:58.997175"]]
---
  def create
    tweet = current_user.tweets.build(tweet_params)
    if tweet.save

SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = $1 AND "tweets"."id" = $2 ORDER BY "tweets"."created_at" DESC LIMIT $3  [["user_id", 1], ["id", 4], ["LIMIT", 1]]
DELETE FROM "tweets" WHERE "tweets"."id" = $1  [["id", 4]]
---
  def destroy
    tweet = current_user.tweets.find(params[:id])
    tweet.destroy