app/controllers/users_controller.rb

  def show
    @user = User.find(params[:format])
    @feeds = @user.tweets.includes(:user) if @user.present?
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = $1 ORDER BY "tweets"."created_at" DESC  [["user_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]