app/models/user.rb

INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["follower_id", 1], ["followed_id", 2], ["created_at", "2020-02-06 13:10:55.114983"], ["updated_at", "2020-02-06 13:10:55.114983"]]
---
  def follow(user)
    active_relationships.create(followed_id: user.id)

DELETE FROM "relationships" WHERE "relationships"."id" = $1  [["id", 1]]
---
  def unfollow(user)
    active_relationships.find_by(followed_id: user.id).destroy